module.exports = {
    ABOUT_US: {
        ru: 'О нас',
        ua: 'Про нас',
    },
    APPOINTMENT: {
        ru: 'Записаться на прием',
        ua: 'Записатись на прийом',
    },
    CHANGE_LANGUAGE: {
        ru: 'Изменить язык',
        ua: 'Змінити мову',
    },
    EMERGENCIES: {
        ru: 'Что такое экстренные случаи',
        ua: 'Що таке екстрені випадки',
    },
    FAQ: {
        ru: 'Часто задаваемые вопросы',
        ua: 'Найпопулярніші запитання',
    },
    MAIN_MENU: {
        ru: '< Назад в главное меню >',
        ua: '< Назад у головне меню >',
    },
    QUESTION: {
        ru: 'Задать свой вопрос',
        ua: 'Задати своє запитання',
    },
};
