module.exports = {
      FEEDING: {
        ru: '🍼 Кормления',
        ua: '🍼 Годування',
      },
      ENTERTAINMENT_AND_SPORTS: {
        ru: '🤸 Развлечения и спорт',
        ua: '🤸 Розваги та спорт',
      }, 
      FOOD_AND_DRINKS: {
        ru: '🥦🥣🥛 Еда и напитки',
        ua: '🥦🥣🥛 Їжа та напої',
      },
      CHILD: {
        ru: '👶 Ребенок',
        ua: '👶 Дитина',
      },
      DISEASE_AND_DISCOMFORT: 
      {
        ru: '🤱 Дискомфорт и заболеваний при вскармливании',
        ua: '🤱 Дискомфорт та захворюваніть при вигодовуванні',
      },
      HYGIENE_AND_THE_POSTPARTUM_PERIOD: {
        ru: '🛀🤰 Гигиена и послеродовой период',
        ua: '🛀🤰 Гігієна та післяпологовий період',
      },
      OTHER: {
        ru: 'Другое',
        ua: 'Інше',
      },
    }

