module.exports = {
    CHOOSE_LANGUAGE_MESSAGE: {
        ru: 'Выберите язык',
        ua: 'Виберіть мову',
    },
    EMERGENCIES_EXTRA_MESSAGE: {
        ru: 'Если у вас одно из вышеперечисленных - срочно звоните в скорую: ',
        ua: 'Якщо у вас одне з вищеперелічених - терміново телефонуйте у швидку: ',
    },
    EMERGENCIES_MESSAGE: {
        ru: 'Угрожающие состояния у детей при которых необходимо вызвать скорую помощь или врача:\n' +
            '- отказ от пищи;\n' +
            '- судомы;\n' +
            '- частое или (и) затрудненное дыхание;\n' +
            '- синюшность кожных покровов;\n' +
            '- повышенная возбудимость или угнетение;\n' +
            '- кровь в испражнениях;\n' +
            '- рвота или понос;\n' +
            '- высокая или низкая температура тела',
        ua: 'Загрозливі стани у дітей при яких необхідно викликати швидку допомогу або лікаря:\n' +
            '- відмова від їжі;\n' +
            '- судоми;\n' +
            '- часте або (і) утруднене дихання;\n' +
            '- синюшність шкірних покривів;\n' +
            '- підвищена збудливість або пригнічення;\n' +
            '- кров у випорожненнях;\n' +
            '- блювота або пронос;\n' +
            '- висока або низька температура тіла\n',
    },
    EMERGENCY_PHONE_NUMBER: 103,
    IN_DEVELOPMENT_MESSAGE: {
        ru: 'Данная функция находится на стадии разработки. Извините за временные неудобства',
        ua: 'Дана функція знаходиться на стадії розробки. Вибачте за тимчасові незручності',
    },
    LANGUAGE_IS_CHANGED_MESSAGE: {
        ru: 'Язык системы изменен на русский',
        ua: 'Мова системи змінена на українську',
    },
    WELCOME_MESSAGE: {
        ru: 'Привет! Я чат-бот!\n' + 'Я здесь для того, чтобы поддержать Вас, предоставить Вам надлежащую' +
            ' профессиональную помощь медицинских работников, в отношении грудного вскармливания, ответить на' +
            ' вопросы, которые Вас интересуют и помочь разобраться в ситуациях, которые Вас волнуют в этот' +
            ' счастливый и, временами, непонятный момент установления связи "мать-ребенок"',
        ua: 'Привіт! Я чат-бот!\n' + 'Я тут для того, щоб підтримати Вас, надати Вам належну професійну допомогу' +
            ' медичних працівників, стосовно грудного вигодовування, відповісти на питання, які Вас цікавлять і' +
            ' допомогти розібратися в ситуаціях, які Вас хвилюють в цей щасливий і, часом, незрозумілий момент' +
            ' встановлення зв\'язку "мати-дитина"'
    },
};
