module.exports = {
    APPOINTMENT_AFTER_MESSAGE: {
        ru: 'Мы работаем с 9:00 до 16:00. Чтобы записаться на прием - позвоните соответствующему специалисту',
        ua: 'Ми працюємо з 9:00 до 16:00. Щоб записатись на прийом - зателефонуйте відповідному спеціалісту',
    },
    APPOINTMENT_BEFORE_MESSAGE: {
        ru: 'Сегодня на приеме:\n\n',
        ua: 'Сьогодні на прийомі:\n\n',
    },
    APPOINTMENT_DAY_OFF_AFTER_MESSAGE: {
        ru: 'Время приема звонков с 8:00 до 19:00. Чтобы записаться на прием - позвоните соответствующему специалисту',
        ua: 'Час прийому дзвінків з 8:00 до 19:00. Щоб записатись на прийом - зателефонуйте відповідному спеціалісту',
    },
    APPOINTMENT_DAY_OFF_BEFORE_MESSAGE: {
        ru: 'Сегодня задействованы все специалисты:\n\n',
        ua: 'Сьогодні задіяні всі спеціалісти:\n\n',
    },
    BACK_TO_MENU_MESSAGE: {
        ru: 'Главное меню',
        ua: 'Головне меню',
    },
    CHOOSE_LANGUAGE_MESSAGE: {
        ru: 'Выберите язык',
        ua: 'Виберіть мову',
    },
    CHOOSE_QUESTION_MESSAGE_PART_TWO: {
        ru: 'Пожалуйста, Выберите вопрос из списка',
        ua: 'Будь ласка, виберіть запитання із списку',
    },
    CHOOSE_QUESTION_MESSAGE_PART_ONE: {
        ru: 'Вы выбрали категорию ',
        ua: 'Ви обрали категорію ',
    },
    DAY_OFF_SORRY_MESSAGE_AFTER: {
        ru: 'Время приема звонков с 8:00 до 19:00. Чтобы получить помощь - позвоните соответствующему специалисту',
        ua: 'Час прийому дзвінків з 8:00 до 19:00. Щоб отримати допомогу - зателефонуйте відповідному спеціалісту',
    },
    DAY_OFF_SORRY_MESSAGE_BEFORE: {
        ru: 'По Вашему вопросу следует обратиться за живой помощью. Сегодня задействованы все специалисты:\n',
        ua: 'По Вашому запитанню варто звернутися за живою допомогою. Сьогодні задіяні всі спеціалісти:\n',
    },
    EMERGENCIES_EXTRA_MESSAGE: {
        ru: 'Если у вас одно из вышеперечисленных - срочно звоните в скорую ',
        ua: 'Якщо у вас одне з вищеперелічених - терміново телефонуйте у швидку ',
    },
    EMERGENCIES_MESSAGE: {
        ru: 'Угрожающие состояния у детей при которых необходимо вызвать скорую помощь или врача:\n' +
            '- отказ от пищи;\n' +
            '- судомы;\n' +
            '- частое или (и) затрудненное дыхание;\n' +
            '- синюшность кожных покровов;\n' +
            '- повышенная возбудимость или угнетение;\n' +
            '- кровь в испражнениях;\n' +
            '- рвота или понос;\n' +
            '- высокая или низкая температура тела',
        ua: 'Загрозливі стани у дітей при яких необхідно викликати швидку допомогу або лікаря:\n' +
            '- відмова від їжі;\n' +
            '- судоми;\n' +
            '- часте або (і) утруднене дихання;\n' +
            '- синюшність шкірних покривів;\n' +
            '- підвищена збудливість або пригнічення;\n' +
            '- кров у випорожненнях;\n' +
            '- блювота або пронос;\n' +
            '- висока або низька температура тіла\n',
    },
    EMERGENCY_CONTACT: {
        NAME: {
            ru: 'Скорая помощь',
            ua: 'Швидка допомога'
        },
        PHONE_NUMBER: '0661030303',
    },
    FAQ_MESSAGE: {
        ru: 'Выберите категорию',
        ua: 'Виберіть категорію',
    },
    IN_DEVELOPMENT_MESSAGE: {
        ru: 'Данная функция находится на стадии разработки. Извините за временные неудобства',
        ua: 'Дана функція знаходиться на стадії розробки. Вибачте за тимчасові незручності',
    },
    LANGUAGE_IS_CHANGED_MESSAGE: {
        ru: 'Язык системы изменен на русский',
        ua: 'Мова системи змінена на українську',
    },
    SORRY_MESSAGE_AFTER: {
        ru: 'Мы работаем с 9:00 до 16:00. Чтобы получить помощь - позвоните соответствующему специалисту',
        ua: 'Ми працюємо з 9:00 до 16:00. Щоб отримати допомогу - зателефонуйте відповідному спеціалісту',
    },
    SORRY_MESSAGE_BEFORE: {
        ru: 'По Вашему вопросу следует обратиться за живой помощью. Сейчас на приеме:\n\n',
        ua: 'По Вашому запитанню варто звернутися за живою допомогою. Зараз на прийомі:\n\n',
    },
    GET_TRAINING_PHRASE_PART_ONE: {
        ru: 'Возможно вы имели в виду: \n',
        ua: 'Можливо ви мали на увазі: \n',
    },
    GET_TRAINING_PHRASE_PART_TWO: {
        ru: 'Если нет, то уточните, пожалуйста, свой вопрос или перейдите в ',
        ua: 'Якщо ні, то уточніть, будь ласка, своє запитання або перейдіть у ',
    },
    WELCOME_MESSAGE: {
        ru: 'Привет! Я чат-бот!\n' + 'Я здесь для того, чтобы поддержать Вас, предоставить Вам надлежащую' +
            ' профессиональную помощь медицинских работников, в отношении грудного вскармливания, ответить на' +
            ' вопросы, которые Вас интересуют и помочь разобраться в ситуациях, которые Вас волнуют в этот' +
            ' счастливый и, временами, непонятный момент установления связи "мать-ребенок"\n\n' +
            'ℹ️ Как пользоваться ботом:\n\n' +
            '👉 Вы можете задать свой вопрос.\n' +
            'Например:\n' +
            '- Можно ли в период кормления грудью красить волосы?\n' +
            '- Может ли женщина, кормящая грудью, заниматься спортом?\n' +
            '- Можно ли женщине кормящей грудью пить кофе? \n\n' +
            '👉 Или нажать в меню "Часто задаваемые вопросы" \n',
        ua: 'Привіт! Я чат-бот!\n' + 'Я тут для того, щоб підтримати Вас, надати Вам належну професійну допомогу' +
            ' медичних працівників, стосовно грудного вигодовування, відповісти на питання, які Вас цікавлять і' +
            ' допомогти розібратися в ситуаціях, які Вас хвилюють в цей щасливий і, часом, незрозумілий момент' +
            ' встановлення зв\'язку "мати-дитина"\n\n' +
            'ℹ️ Як користуватись ботом:\n\n' + 
            '👉 Ви можете задати своє запитання.\n' +
            'Наприклад:\n' +
            '- Чи можна в період годування грудьми фарбувати волосся?\n' +
            '- Чи може жінка, що годує грудьми , займатися спортом?\n' +
            '- Чи можна жінці що годує грудьми пити каву?\n\n' +
            '👉 Або натиснути у меню "Найпопулярніші запитання"\n',
    },
};
