module.exports = {
    DAYS_OF_WEEK: {
        0: {
            ru: 'Воскресенье',
            ua: 'Неділя',
        },
        1: {
            ru: 'Понедельник',
            ua: 'Понеділок',
        },
        2: {
            ru: 'Вторник',
            ua: 'Вівторок',
        },
        3: {
            ru: 'Среда',
            ua: 'Середа',
        },
        4: {
            ru: 'Четверг',
            ua: 'Четвер',
        },
        5: {
            ru: 'Пятница',
            ua: 'П\'ятниця',
        },
        6: {
            ru: 'Суббота',
            ua: 'Субота',
        },
    },
    LANGUAGE_CODES: {
        ru: 'ru',
        ua: 'ua',
    },
    LANGUAGES: {
        ru: 'Русский',
        ua: 'Українська',
    },
    TIME_ZONE_OFFSET: +3,
    WORKING_HOURS: {
        0: {
            from: '8:00',
            to: '19:00',
        },
        1: {
            from: '9:00',
            to: '16:00',
        },
        2: {
            from: '9:00',
            to: '16:00',
        },
        3: {
            from: '9:00',
            to: '16:00',
        },
        4: {
            from: '9:00',
            to: '16:00',
        },
        5: {
            from: '9:00',
            to: '16:00',
        },
        6: {
            from: '8:00',
            to: '19:00',
        },
    }
};
