// const welcomeMessage = {
//     name: 'welcomeMessage',
//     params: {
//         ua: 'Привіт! Я чат-бот!\n' + 'Я тут для того, щоб підтримати Вас, надати Вам належну професійну допомогу' +
//             ' медичних працівників, стосовно грудного вигодовування, відповісти на питання, які Вас цікавлять і' +
//             ' допомогти розібратися в ситуаціях, які Вас хвилюють в цей щасливий і, часом, незрозумілий момент' +
//             ' встановлення зв\'язку "мати-дитина"',
//         ru: 'Привет! Я чат-бот!\n' + 'Я здесь для того, чтобы поддержать Вас, предоставить Вам надлежащую' +
//             ' профессиональную помощь медицинских работников, в отношении грудного вскармливания, ответить на' +
//             ' вопросы, которые Вас интересуют и помочь разобраться в ситуациях, которые Вас волнуют в этот' +
//             ' счастливый и, временами, непонятный момент установления связи "мать-ребенок"'
//     }
// };
//
// setWelcomeMessage = async () => {
//     const botInfoModel = require('./models/bot-info.model');
//
//     const {name} = welcomeMessage;
//     const data = await botInfoModel.findOne({name});
//
//     if (!data) {
//         await botInfoModel(welcomeMessage).save();
//     }
// }
//
// module.exports = async () => {
//     await setWelcomeMessage();
// };
